grevaillot/svd_tools/headers/STM32F427/can2.h
#pragma once 

/* --- CAN2: Controller area network -------------------------------- */

/** @defgroup can2_registers Controller area network Register
@{*/

/** CAN2_MCR master control register **/
#define CAN2_MCR			MMIO32(CAN2_BASE + 0x00)
/** CAN2_MSR master status register **/
#define CAN2_MSR			MMIO32(CAN2_BASE + 0x04)
/** CAN2_TSR transmit status register **/
#define CAN2_TSR			MMIO32(CAN2_BASE + 0x08)
/** CAN2_RF0R receive FIFO 0 register **/
#define CAN2_RF0R			MMIO32(CAN2_BASE + 0x0c)
/** CAN2_RF1R receive FIFO 1 register **/
#define CAN2_RF1R			MMIO32(CAN2_BASE + 0x10)
/** CAN2_IER interrupt enable register **/
#define CAN2_IER			MMIO32(CAN2_BASE + 0x14)
/** CAN2_ESR interrupt enable register **/
#define CAN2_ESR			MMIO32(CAN2_BASE + 0x18)
/** CAN2_BTR bit timing register **/
#define CAN2_BTR			MMIO32(CAN2_BASE + 0x1c)
/** CAN2_TI0R TX mailbox identifier register **/
#define CAN2_TI0R			MMIO32(CAN2_BASE + 0x180)
/** CAN2_TDT0R mailbox data length control and time stamp register **/
#define CAN2_TDT0R			MMIO32(CAN2_BASE + 0x184)
/** CAN2_TDL0R mailbox data low register **/
#define CAN2_TDL0R			MMIO32(CAN2_BASE + 0x188)
/** CAN2_TDH0R mailbox data high register **/
#define CAN2_TDH0R			MMIO32(CAN2_BASE + 0x18c)
/** CAN2_TI1R mailbox identifier register **/
#define CAN2_TI1R			MMIO32(CAN2_BASE + 0x190)
/** CAN2_TDT1R mailbox data length control and time stamp register **/
#define CAN2_TDT1R			MMIO32(CAN2_BASE + 0x194)
/** CAN2_TDL1R mailbox data low register **/
#define CAN2_TDL1R			MMIO32(CAN2_BASE + 0x198)
/** CAN2_TDH1R mailbox data high register **/
#define CAN2_TDH1R			MMIO32(CAN2_BASE + 0x19c)
/** CAN2_TI2R mailbox identifier register **/
#define CAN2_TI2R			MMIO32(CAN2_BASE + 0x1a0)
/** CAN2_TDT2R mailbox data length control and time stamp register **/
#define CAN2_TDT2R			MMIO32(CAN2_BASE + 0x1a4)
/** CAN2_TDL2R mailbox data low register **/
#define CAN2_TDL2R			MMIO32(CAN2_BASE + 0x1a8)
/** CAN2_TDH2R mailbox data high register **/
#define CAN2_TDH2R			MMIO32(CAN2_BASE + 0x1ac)
/** CAN2_RI0R receive FIFO mailbox identifier register **/
#define CAN2_RI0R			MMIO32(CAN2_BASE + 0x1b0)
/** CAN2_RDT0R mailbox data high register **/
#define CAN2_RDT0R			MMIO32(CAN2_BASE + 0x1b4)
/** CAN2_RDL0R mailbox data high register **/
#define CAN2_RDL0R			MMIO32(CAN2_BASE + 0x1b8)
/** CAN2_RDH0R receive FIFO mailbox data high register **/
#define CAN2_RDH0R			MMIO32(CAN2_BASE + 0x1bc)
/** CAN2_RI1R mailbox data high register **/
#define CAN2_RI1R			MMIO32(CAN2_BASE + 0x1c0)
/** CAN2_RDT1R mailbox data high register **/
#define CAN2_RDT1R			MMIO32(CAN2_BASE + 0x1c4)
/** CAN2_RDL1R mailbox data high register **/
#define CAN2_RDL1R			MMIO32(CAN2_BASE + 0x1c8)
/** CAN2_RDH1R mailbox data high register **/
#define CAN2_RDH1R			MMIO32(CAN2_BASE + 0x1cc)
/** CAN2_FMR filter master register **/
#define CAN2_FMR			MMIO32(CAN2_BASE + 0x200)
/** CAN2_FM1R filter mode register **/
#define CAN2_FM1R			MMIO32(CAN2_BASE + 0x204)
/** CAN2_FS1R filter scale register **/
#define CAN2_FS1R			MMIO32(CAN2_BASE + 0x20c)
/** CAN2_FFA1R filter FIFO assignment register **/
#define CAN2_FFA1R			MMIO32(CAN2_BASE + 0x214)
/** CAN2_FA1R filter activation register **/
#define CAN2_FA1R			MMIO32(CAN2_BASE + 0x21c)
/** CAN2_F0R1 Filter bank 0 register 1 **/
#define CAN2_F0R1			MMIO32(CAN2_BASE + 0x240)
/** CAN2_F0R2 Filter bank 0 register 2 **/
#define CAN2_F0R2			MMIO32(CAN2_BASE + 0x244)
/** CAN2_F1R1 Filter bank 1 register 1 **/
#define CAN2_F1R1			MMIO32(CAN2_BASE + 0x248)
/** CAN2_F1R2 Filter bank 1 register 2 **/
#define CAN2_F1R2			MMIO32(CAN2_BASE + 0x24c)
/** CAN2_F2R1 Filter bank 2 register 1 **/
#define CAN2_F2R1			MMIO32(CAN2_BASE + 0x250)
/** CAN2_F2R2 Filter bank 2 register 2 **/
#define CAN2_F2R2			MMIO32(CAN2_BASE + 0x254)
/** CAN2_F3R1 Filter bank 3 register 1 **/
#define CAN2_F3R1			MMIO32(CAN2_BASE + 0x258)
/** CAN2_F3R2 Filter bank 3 register 2 **/
#define CAN2_F3R2			MMIO32(CAN2_BASE + 0x25c)
/** CAN2_F4R1 Filter bank 4 register 1 **/
#define CAN2_F4R1			MMIO32(CAN2_BASE + 0x260)
/** CAN2_F4R2 Filter bank 4 register 2 **/
#define CAN2_F4R2			MMIO32(CAN2_BASE + 0x264)
/** CAN2_F5R1 Filter bank 5 register 1 **/
#define CAN2_F5R1			MMIO32(CAN2_BASE + 0x268)
/** CAN2_F5R2 Filter bank 5 register 2 **/
#define CAN2_F5R2			MMIO32(CAN2_BASE + 0x26c)
/** CAN2_F6R1 Filter bank 6 register 1 **/
#define CAN2_F6R1			MMIO32(CAN2_BASE + 0x270)
/** CAN2_F6R2 Filter bank 6 register 2 **/
#define CAN2_F6R2			MMIO32(CAN2_BASE + 0x274)
/** CAN2_F7R1 Filter bank 7 register 1 **/
#define CAN2_F7R1			MMIO32(CAN2_BASE + 0x278)
/** CAN2_F7R2 Filter bank 7 register 2 **/
#define CAN2_F7R2			MMIO32(CAN2_BASE + 0x27c)
/** CAN2_F8R1 Filter bank 8 register 1 **/
#define CAN2_F8R1			MMIO32(CAN2_BASE + 0x280)
/** CAN2_F8R2 Filter bank 8 register 2 **/
#define CAN2_F8R2			MMIO32(CAN2_BASE + 0x284)
/** CAN2_F9R1 Filter bank 9 register 1 **/
#define CAN2_F9R1			MMIO32(CAN2_BASE + 0x288)
/** CAN2_F9R2 Filter bank 9 register 2 **/
#define CAN2_F9R2			MMIO32(CAN2_BASE + 0x28c)
/** CAN2_F10R1 Filter bank 10 register 1 **/
#define CAN2_F10R1			MMIO32(CAN2_BASE + 0x290)
/** CAN2_F10R2 Filter bank 10 register 2 **/
#define CAN2_F10R2			MMIO32(CAN2_BASE + 0x294)
/** CAN2_F11R1 Filter bank 11 register 1 **/
#define CAN2_F11R1			MMIO32(CAN2_BASE + 0x298)
/** CAN2_F11R2 Filter bank 11 register 2 **/
#define CAN2_F11R2			MMIO32(CAN2_BASE + 0x29c)
/** CAN2_F12R1 Filter bank 4 register 1 **/
#define CAN2_F12R1			MMIO32(CAN2_BASE + 0x2a0)
/** CAN2_F12R2 Filter bank 12 register 2 **/
#define CAN2_F12R2			MMIO32(CAN2_BASE + 0x2a4)
/** CAN2_F13R1 Filter bank 13 register 1 **/
#define CAN2_F13R1			MMIO32(CAN2_BASE + 0x2a8)
/** CAN2_F13R2 Filter bank 13 register 2 **/
#define CAN2_F13R2			MMIO32(CAN2_BASE + 0x2ac)
/** CAN2_F14R1 Filter bank 14 register 1 **/
#define CAN2_F14R1			MMIO32(CAN2_BASE + 0x2b0)
/** CAN2_F14R2 Filter bank 14 register 2 **/
#define CAN2_F14R2			MMIO32(CAN2_BASE + 0x2b4)
/** CAN2_F15R1 Filter bank 15 register 1 **/
#define CAN2_F15R1			MMIO32(CAN2_BASE + 0x2b8)
/** CAN2_F15R2 Filter bank 15 register 2 **/
#define CAN2_F15R2			MMIO32(CAN2_BASE + 0x2bc)
/** CAN2_F16R1 Filter bank 16 register 1 **/
#define CAN2_F16R1			MMIO32(CAN2_BASE + 0x2c0)
/** CAN2_F16R2 Filter bank 16 register 2 **/
#define CAN2_F16R2			MMIO32(CAN2_BASE + 0x2c4)
/** CAN2_F17R1 Filter bank 17 register 1 **/
#define CAN2_F17R1			MMIO32(CAN2_BASE + 0x2c8)
/** CAN2_F17R2 Filter bank 17 register 2 **/
#define CAN2_F17R2			MMIO32(CAN2_BASE + 0x2cc)
/** CAN2_F18R1 Filter bank 18 register 1 **/
#define CAN2_F18R1			MMIO32(CAN2_BASE + 0x2d0)
/** CAN2_F18R2 Filter bank 18 register 2 **/
#define CAN2_F18R2			MMIO32(CAN2_BASE + 0x2d4)
/** CAN2_F19R1 Filter bank 19 register 1 **/
#define CAN2_F19R1			MMIO32(CAN2_BASE + 0x2d8)
/** CAN2_F19R2 Filter bank 19 register 2 **/
#define CAN2_F19R2			MMIO32(CAN2_BASE + 0x2dc)
/** CAN2_F20R1 Filter bank 20 register 1 **/
#define CAN2_F20R1			MMIO32(CAN2_BASE + 0x2e0)
/** CAN2_F20R2 Filter bank 20 register 2 **/
#define CAN2_F20R2			MMIO32(CAN2_BASE + 0x2e4)
/** CAN2_F21R1 Filter bank 21 register 1 **/
#define CAN2_F21R1			MMIO32(CAN2_BASE + 0x2e8)
/** CAN2_F21R2 Filter bank 21 register 2 **/
#define CAN2_F21R2			MMIO32(CAN2_BASE + 0x2ec)
/** CAN2_F22R1 Filter bank 22 register 1 **/
#define CAN2_F22R1			MMIO32(CAN2_BASE + 0x2f0)
/** CAN2_F22R2 Filter bank 22 register 2 **/
#define CAN2_F22R2			MMIO32(CAN2_BASE + 0x2f4)
/** CAN2_F23R1 Filter bank 23 register 1 **/
#define CAN2_F23R1			MMIO32(CAN2_BASE + 0x2f8)
/** CAN2_F23R2 Filter bank 23 register 2 **/
#define CAN2_F23R2			MMIO32(CAN2_BASE + 0x2fc)
/** CAN2_F24R1 Filter bank 24 register 1 **/
#define CAN2_F24R1			MMIO32(CAN2_BASE + 0x300)
/** CAN2_F24R2 Filter bank 24 register 2 **/
#define CAN2_F24R2			MMIO32(CAN2_BASE + 0x304)
/** CAN2_F25R1 Filter bank 25 register 1 **/
#define CAN2_F25R1			MMIO32(CAN2_BASE + 0x308)
/** CAN2_F25R2 Filter bank 25 register 2 **/
#define CAN2_F25R2			MMIO32(CAN2_BASE + 0x30c)
/** CAN2_F26R1 Filter bank 26 register 1 **/
#define CAN2_F26R1			MMIO32(CAN2_BASE + 0x310)
/** CAN2_F26R2 Filter bank 26 register 2 **/
#define CAN2_F26R2			MMIO32(CAN2_BASE + 0x314)
/** CAN2_F27R1 Filter bank 27 register 1 **/
#define CAN2_F27R1			MMIO32(CAN2_BASE + 0x318)
/** CAN2_F27R2 Filter bank 27 register 2 **/
#define CAN2_F27R2			MMIO32(CAN2_BASE + 0x31c)

/**@}*/


/** @defgroup can2_mcr MCR master control register
@{*/

/** CAN2_MCR_DBF DBF **/
#define CAN2_MCR_DBF		(1 << 16)
/** CAN2_MCR_RESET RESET **/
#define CAN2_MCR_RESET		(1 << 15)
/** CAN2_MCR_TTCM TTCM **/
#define CAN2_MCR_TTCM		(1 << 7)
/** CAN2_MCR_ABOM ABOM **/
#define CAN2_MCR_ABOM		(1 << 6)
/** CAN2_MCR_AWUM AWUM **/
#define CAN2_MCR_AWUM		(1 << 5)
/** CAN2_MCR_NART NART **/
#define CAN2_MCR_NART		(1 << 4)
/** CAN2_MCR_RFLM RFLM **/
#define CAN2_MCR_RFLM		(1 << 3)
/** CAN2_MCR_TXFP TXFP **/
#define CAN2_MCR_TXFP		(1 << 2)
/** CAN2_MCR_SLEEP SLEEP **/
#define CAN2_MCR_SLEEP		(1 << 1)
/** CAN2_MCR_INRQ INRQ **/
#define CAN2_MCR_INRQ		(1 << 0)

/**@}*/

/** @defgroup can2_msr MSR master status register
@{*/

/** CAN2_MSR_RX RX **/
#define CAN2_MSR_RX		(1 << 11)
/** CAN2_MSR_SAMP SAMP **/
#define CAN2_MSR_SAMP		(1 << 10)
/** CAN2_MSR_RXM RXM **/
#define CAN2_MSR_RXM		(1 << 9)
/** CAN2_MSR_TXM TXM **/
#define CAN2_MSR_TXM		(1 << 8)
/** CAN2_MSR_SLAKI SLAKI **/
#define CAN2_MSR_SLAKI		(1 << 4)
/** CAN2_MSR_WKUI WKUI **/
#define CAN2_MSR_WKUI		(1 << 3)
/** CAN2_MSR_ERRI ERRI **/
#define CAN2_MSR_ERRI		(1 << 2)
/** CAN2_MSR_SLAK SLAK **/
#define CAN2_MSR_SLAK		(1 << 1)
/** CAN2_MSR_INAK INAK **/
#define CAN2_MSR_INAK		(1 << 0)

/**@}*/

/** @defgroup can2_tsr TSR transmit status register
@{*/

/** CAN2_TSR_LOW2 Lowest priority flag for mailbox 2 **/
#define CAN2_TSR_LOW2		(1 << 31)
/** CAN2_TSR_LOW1 Lowest priority flag for mailbox 1 **/
#define CAN2_TSR_LOW1		(1 << 30)
/** CAN2_TSR_LOW0 Lowest priority flag for mailbox 0 **/
#define CAN2_TSR_LOW0		(1 << 29)
/** CAN2_TSR_TME2 Lowest priority flag for mailbox 2 **/
#define CAN2_TSR_TME2		(1 << 28)
/** CAN2_TSR_TME1 Lowest priority flag for mailbox 1 **/
#define CAN2_TSR_TME1		(1 << 27)
/** CAN2_TSR_TME0 Lowest priority flag for mailbox 0 **/
#define CAN2_TSR_TME0		(1 << 26)

#define CAN2_TSR_CODE_SHIFT		24
#define CAN2_TSR_CODE_MASK		0x03
/** @defgroup can2_tsr_code CODE CODE
@{*/
/**@}*/

/** CAN2_TSR_ABRQ2 ABRQ2 **/
#define CAN2_TSR_ABRQ2		(1 << 23)
/** CAN2_TSR_TERR2 TERR2 **/
#define CAN2_TSR_TERR2		(1 << 19)
/** CAN2_TSR_ALST2 ALST2 **/
#define CAN2_TSR_ALST2		(1 << 18)
/** CAN2_TSR_TXOK2 TXOK2 **/
#define CAN2_TSR_TXOK2		(1 << 17)
/** CAN2_TSR_RQCP2 RQCP2 **/
#define CAN2_TSR_RQCP2		(1 << 16)
/** CAN2_TSR_ABRQ1 ABRQ1 **/
#define CAN2_TSR_ABRQ1		(1 << 15)
/** CAN2_TSR_TERR1 TERR1 **/
#define CAN2_TSR_TERR1		(1 << 11)
/** CAN2_TSR_ALST1 ALST1 **/
#define CAN2_TSR_ALST1		(1 << 10)
/** CAN2_TSR_TXOK1 TXOK1 **/
#define CAN2_TSR_TXOK1		(1 << 9)
/** CAN2_TSR_RQCP1 RQCP1 **/
#define CAN2_TSR_RQCP1		(1 << 8)
/** CAN2_TSR_ABRQ0 ABRQ0 **/
#define CAN2_TSR_ABRQ0		(1 << 7)
/** CAN2_TSR_TERR0 TERR0 **/
#define CAN2_TSR_TERR0		(1 << 3)
/** CAN2_TSR_ALST0 ALST0 **/
#define CAN2_TSR_ALST0		(1 << 2)
/** CAN2_TSR_TXOK0 TXOK0 **/
#define CAN2_TSR_TXOK0		(1 << 1)
/** CAN2_TSR_RQCP0 RQCP0 **/
#define CAN2_TSR_RQCP0		(1 << 0)

/**@}*/

/** @defgroup can2_rf0r RF0R receive FIFO 0 register
@{*/

/** CAN2_RF0R_RFOM0 RFOM0 **/
#define CAN2_RF0R_RFOM0		(1 << 5)
/** CAN2_RF0R_FOVR0 FOVR0 **/
#define CAN2_RF0R_FOVR0		(1 << 4)
/** CAN2_RF0R_FULL0 FULL0 **/
#define CAN2_RF0R_FULL0		(1 << 3)

#define CAN2_RF0R_FMP0_SHIFT		0
#define CAN2_RF0R_FMP0_MASK		0x03
/** @defgroup can2_rf0r_fmp0 FMP0 FMP0
@{*/
/**@}*/


/**@}*/

/** @defgroup can2_rf1r RF1R receive FIFO 1 register
@{*/

