grevaillot/svd_tools/headers/STM32F427/can2.h
#define CAN2_TDT2R_DLC_SHIFT		0
#define CAN2_TDT2R_DLC_MASK		0x0f
/** @defgroup can2_tdt2r_dlc DLC DLC
@{*/
/**@}*/


/**@}*/

/** @defgroup can2_tdl2r TDL2R mailbox data low register
@{*/


#define CAN2_TDL2R_DATA3_SHIFT		24
#define CAN2_TDL2R_DATA3_MASK		0xff
/** @defgroup can2_tdl2r_data3 DATA3 DATA3
@{*/
/**@}*/


#define CAN2_TDL2R_DATA2_SHIFT		16
#define CAN2_TDL2R_DATA2_MASK		0xff
/** @defgroup can2_tdl2r_data2 DATA2 DATA2
@{*/
/**@}*/


#define CAN2_TDL2R_DATA1_SHIFT		8
#define CAN2_TDL2R_DATA1_MASK		0xff
/** @defgroup can2_tdl2r_data1 DATA1 DATA1
@{*/
/**@}*/


#define CAN2_TDL2R_DATA0_SHIFT		0
#define CAN2_TDL2R_DATA0_MASK		0xff
/** @defgroup can2_tdl2r_data0 DATA0 DATA0
@{*/
/**@}*/


/**@}*/

/** @defgroup can2_tdh2r TDH2R mailbox data high register
@{*/


#define CAN2_TDH2R_DATA7_SHIFT		24
#define CAN2_TDH2R_DATA7_MASK		0xff
/** @defgroup can2_tdh2r_data7 DATA7 DATA7
@{*/
/**@}*/


#define CAN2_TDH2R_DATA6_SHIFT		16
#define CAN2_TDH2R_DATA6_MASK		0xff
/** @defgroup can2_tdh2r_data6 DATA6 DATA6
@{*/
/**@}*/


#define CAN2_TDH2R_DATA5_SHIFT		8
#define CAN2_TDH2R_DATA5_MASK		0xff
/** @defgroup can2_tdh2r_data5 DATA5 DATA5
@{*/
/**@}*/


#define CAN2_TDH2R_DATA4_SHIFT		0
#define CAN2_TDH2R_DATA4_MASK		0xff
/** @defgroup can2_tdh2r_data4 DATA4 DATA4
@{*/
/**@}*/


/**@}*/

/** @defgroup can2_ri0r RI0R receive FIFO mailbox identifier register
@{*/


#define CAN2_RI0R_STID_SHIFT		21
#define CAN2_RI0R_STID_MASK		0x7ff
/** @defgroup can2_ri0r_stid STID STID
@{*/
/**@}*/


#define CAN2_RI0R_EXID_SHIFT		3
#define CAN2_RI0R_EXID_MASK		0x3ffff
/** @defgroup can2_ri0r_exid EXID EXID
@{*/
/**@}*/

/** CAN2_RI0R_IDE IDE **/
#define CAN2_RI0R_IDE		(1 << 2)
/** CAN2_RI0R_RTR RTR **/
#define CAN2_RI0R_RTR		(1 << 1)

/**@}*/

/** @defgroup can2_rdt0r RDT0R mailbox data high register
@{*/


#define CAN2_RDT0R_TIME_SHIFT		16
#define CAN2_RDT0R_TIME_MASK		0xffff
/** @defgroup can2_rdt0r_time TIME TIME
@{*/
/**@}*/


#define CAN2_RDT0R_FMI_SHIFT		8
#define CAN2_RDT0R_FMI_MASK		0xff
/** @defgroup can2_rdt0r_fmi FMI FMI
@{*/
/**@}*/


#define CAN2_RDT0R_DLC_SHIFT		0
#define CAN2_RDT0R_DLC_MASK		0x0f
/** @defgroup can2_rdt0r_dlc DLC DLC
@{*/
/**@}*/


/**@}*/

/** @defgroup can2_rdl0r RDL0R mailbox data high register
@{*/


#define CAN2_RDL0R_DATA3_SHIFT		24
#define CAN2_RDL0R_DATA3_MASK		0xff
/** @defgroup can2_rdl0r_data3 DATA3 DATA3
@{*/
/**@}*/


#define CAN2_RDL0R_DATA2_SHIFT		16
#define CAN2_RDL0R_DATA2_MASK		0xff
/** @defgroup can2_rdl0r_data2 DATA2 DATA2
@{*/
/**@}*/


#define CAN2_RDL0R_DATA1_SHIFT		8
#define CAN2_RDL0R_DATA1_MASK		0xff
/** @defgroup can2_rdl0r_data1 DATA1 DATA1
@{*/
/**@}*/


#define CAN2_RDL0R_DATA0_SHIFT		0
#define CAN2_RDL0R_DATA0_MASK		0xff
/** @defgroup can2_rdl0r_data0 DATA0 DATA0
@{*/
/**@}*/


/**@}*/

/** @defgroup can2_rdh0r RDH0R receive FIFO mailbox data high register
@{*/


#define CAN2_RDH0R_DATA7_SHIFT		24
#define CAN2_RDH0R_DATA7_MASK		0xff
/** @defgroup can2_rdh0r_data7 DATA7 DATA7
@{*/
/**@}*/


#define CAN2_RDH0R_DATA6_SHIFT		16
#define CAN2_RDH0R_DATA6_MASK		0xff
/** @defgroup can2_rdh0r_data6 DATA6 DATA6
@{*/
/**@}*/


#define CAN2_RDH0R_DATA5_SHIFT		8
#define CAN2_RDH0R_DATA5_MASK		0xff
/** @defgroup can2_rdh0r_data5 DATA5 DATA5
@{*/
/**@}*/


#define CAN2_RDH0R_DATA4_SHIFT		0
#define CAN2_RDH0R_DATA4_MASK		0xff
/** @defgroup can2_rdh0r_data4 DATA4 DATA4
@{*/
/**@}*/


/**@}*/

/** @defgroup can2_ri1r RI1R mailbox data high register
@{*/


#define CAN2_RI1R_STID_SHIFT		21
#define CAN2_RI1R_STID_MASK		0x7ff
/** @defgroup can2_ri1r_stid STID STID
@{*/
/**@}*/


#define CAN2_RI1R_EXID_SHIFT		3
#define CAN2_RI1R_EXID_MASK		0x3ffff
/** @defgroup can2_ri1r_exid EXID EXID
@{*/
/**@}*/

/** CAN2_RI1R_IDE IDE **/
#define CAN2_RI1R_IDE		(1 << 2)
/** CAN2_RI1R_RTR RTR **/
#define CAN2_RI1R_RTR		(1 << 1)

/**@}*/

/** @defgroup can2_rdt1r RDT1R mailbox data high register
@{*/


#define CAN2_RDT1R_TIME_SHIFT		16
#define CAN2_RDT1R_TIME_MASK		0xffff
/** @defgroup can2_rdt1r_time TIME TIME
@{*/
/**@}*/


#define CAN2_RDT1R_FMI_SHIFT		8
#define CAN2_RDT1R_FMI_MASK		0xff
/** @defgroup can2_rdt1r_fmi FMI FMI
@{*/
/**@}*/


#define CAN2_RDT1R_DLC_SHIFT		0
#define CAN2_RDT1R_DLC_MASK		0x0f
/** @defgroup can2_rdt1r_dlc DLC DLC
@{*/
/**@}*/


/**@}*/

/** @defgroup can2_rdl1r RDL1R mailbox data high register
@{*/


#define CAN2_RDL1R_DATA3_SHIFT		24
#define CAN2_RDL1R_DATA3_MASK		0xff
/** @defgroup can2_rdl1r_data3 DATA3 DATA3
@{*/
/**@}*/


#define CAN2_RDL1R_DATA2_SHIFT		16
#define CAN2_RDL1R_DATA2_MASK		0xff
/** @defgroup can2_rdl1r_data2 DATA2 DATA2
@{*/
/**@}*/


#define CAN2_RDL1R_DATA1_SHIFT		8
#define CAN2_RDL1R_DATA1_MASK		0xff
/** @defgroup can2_rdl1r_data1 DATA1 DATA1
@{*/
/**@}*/


#define CAN2_RDL1R_DATA0_SHIFT		0
#define CAN2_RDL1R_DATA0_MASK		0xff
/** @defgroup can2_rdl1r_data0 DATA0 DATA0
@{*/
/**@}*/


/**@}*/

/** @defgroup can2_rdh1r RDH1R mailbox data high register
@{*/


#define CAN2_RDH1R_DATA7_SHIFT		24
#define CAN2_RDH1R_DATA7_MASK		0xff
/** @defgroup can2_rdh1r_data7 DATA7 DATA7
@{*/
/**@}*/


#define CAN2_RDH1R_DATA6_SHIFT		16
#define CAN2_RDH1R_DATA6_MASK		0xff
/** @defgroup can2_rdh1r_data6 DATA6 DATA6
@{*/
/**@}*/


#define CAN2_RDH1R_DATA5_SHIFT		8
#define CAN2_RDH1R_DATA5_MASK		0xff
/** @defgroup can2_rdh1r_data5 DATA5 DATA5
@{*/
/**@}*/


#define CAN2_RDH1R_DATA4_SHIFT		0
#define CAN2_RDH1R_DATA4_MASK		0xff
/** @defgroup can2_rdh1r_data4 DATA4 DATA4
@{*/
/**@}*/


/**@}*/

/** @defgroup can2_fmr FMR filter master register
@{*/


#define CAN2_FMR_CAN2SB_SHIFT		8
#define CAN2_FMR_CAN2SB_MASK		0x3f
/** @defgroup can2_fmr_can2sb CAN2SB CAN2SB
@{*/
/**@}*/

/** CAN2_FMR_FINIT FINIT **/
#define CAN2_FMR_FINIT		(1 << 0)

/**@}*/

/** @defgroup can2_fm1r FM1R filter mode register
@{*/

/** CAN2_FM1R_FBM27 Filter mode **/
#define CAN2_FM1R_FBM27		(1 << 27)
/** CAN2_FM1R_FBM26 Filter mode **/
#define CAN2_FM1R_FBM26		(1 << 26)
/** CAN2_FM1R_FBM25 Filter mode **/
#define CAN2_FM1R_FBM25		(1 << 25)
/** CAN2_FM1R_FBM24 Filter mode **/
#define CAN2_FM1R_FBM24		(1 << 24)
/** CAN2_FM1R_FBM23 Filter mode **/
#define CAN2_FM1R_FBM23		(1 << 23)
/** CAN2_FM1R_FBM22 Filter mode **/
#define CAN2_FM1R_FBM22		(1 << 22)
/** CAN2_FM1R_FBM21 Filter mode **/
#define CAN2_FM1R_FBM21		(1 << 21)
/** CAN2_FM1R_FBM20 Filter mode **/
#define CAN2_FM1R_FBM20		(1 << 20)
/** CAN2_FM1R_FBM19 Filter mode **/
#define CAN2_FM1R_FBM19		(1 << 19)
/** CAN2_FM1R_FBM18 Filter mode **/
#define CAN2_FM1R_FBM18		(1 << 18)
/** CAN2_FM1R_FBM17 Filter mode **/
#define CAN2_FM1R_FBM17		(1 << 17)
/** CAN2_FM1R_FBM16 Filter mode **/
#define CAN2_FM1R_FBM16		(1 << 16)
/** CAN2_FM1R_FBM15 Filter mode **/
#define CAN2_FM1R_FBM15		(1 << 15)
/** CAN2_FM1R_FBM14 Filter mode **/
#define CAN2_FM1R_FBM14		(1 << 14)
/** CAN2_FM1R_FBM13 Filter mode **/
#define CAN2_FM1R_FBM13		(1 << 13)
/** CAN2_FM1R_FBM12 Filter mode **/
#define CAN2_FM1R_FBM12		(1 << 12)
/** CAN2_FM1R_FBM11 Filter mode **/
#define CAN2_FM1R_FBM11		(1 << 11)
/** CAN2_FM1R_FBM10 Filter mode **/
#define CAN2_FM1R_FBM10		(1 << 10)
/** CAN2_FM1R_FBM9 Filter mode **/
#define CAN2_FM1R_FBM9		(1 << 9)
/** CAN2_FM1R_FBM8 Filter mode **/
#define CAN2_FM1R_FBM8		(1 << 8)
/** CAN2_FM1R_FBM7 Filter mode **/
#define CAN2_FM1R_FBM7		(1 << 7)
/** CAN2_FM1R_FBM6 Filter mode **/
#define CAN2_FM1R_FBM6		(1 << 6)
/** CAN2_FM1R_FBM5 Filter mode **/
#define CAN2_FM1R_FBM5		(1 << 5)
/** CAN2_FM1R_FBM4 Filter mode **/
#define CAN2_FM1R_FBM4		(1 << 4)
/** CAN2_FM1R_FBM3 Filter mode **/
#define CAN2_FM1R_FBM3		(1 << 3)
/** CAN2_FM1R_FBM2 Filter mode **/
#define CAN2_FM1R_FBM2		(1 << 2)
/** CAN2_FM1R_FBM1 Filter mode **/
#define CAN2_FM1R_FBM1		(1 << 1)
/** CAN2_FM1R_FBM0 Filter mode **/
#define CAN2_FM1R_FBM0		(1 << 0)

/**@}*/

/** @defgroup can2_fs1r FS1R filter scale register
@{*/

